package com.polis.api.storage;

public enum MarusiaCommand {
    TEST("ntcn", "тест"),

    EXIT(
        "пока",
        "заверши",
        "закрой",
        "закончи"
    ),

    HOME(
        "начало",
        "заново",
        "назад",
        "выйди",
        "по новой",
        "домашняя страница",
        "старт"
    ),

    SEDATION(
        "успокоиться",
        "успокой",
        "успокоение",
        "успокой",
        "релакс"
    ),

    DISTRACTION(
        "отвлечься",
        "отдохнём",
        "отдых",
        "отвлечение",
        "отвлеки",
        "отвлечь"
    ),

    ADVICE(
        "совет",
        "наставление",
        "напутствие",
        "обсуждение",
        "консультация"
    ),

    HELP(
        "можешь",
        "умеешь",
        "функции",
        "помощь",
        "помоги"
    ),

    // --------------------------------------------------------------

    DISTRACTION_YOGA(
        "йога",
        "йогу",
        "йогой"
    ),

    DISTRACTION_COUNT(
        "числа",
        "играть",
        "играем",
        "играем",
        "считать",
        "посчитать",
        "посчитаем",
        "посчитаю",
        "посчитай",
        "считай",
        "считаем"
    ),

    DISTRACTION_NUMBER_DIVINATION(
        "гадание",
        "гадать",
        "погадаем"
    ),

    HELP_SEDATION(
        "успокоиться",
        "успокой",
        "успокоение",
        "успокой",
        "релакс"
    ),

    HELP_DISTRACTION(
        "отвлечься",
        "отдохнём",
        "отдых",
        "отвлечение",
        "отвлеки",
        "отвлечь"
    ),


    SEDATION_VIDEO(
        "видео",
        "видос"
    ),

    SEDATION_SOUNDS(
        "звуки"
    ),

    SEDATION_MUSIC(
        "музыку",
        "музыка",
        "треки",
        "трек"
    ),

    BREATH_EXERCISE(
        "подышим",
        "пыхнем",
        "дыхательная гимнастика",
        "дышать",
        "вздох",
        "дыхательное",
        "упражнение"
    );

    public final String[] commands;

    MarusiaCommand(String... commands) {
        this.commands = commands;
    }
}
